#3. Пользователь вводит месяц в виде целого числа от 1 до 12.
#Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
#Напишите решения через list и через dict.


"""

# С защитой от ошибки, через словарь

calendar = {
    "1": "Зима",
    "2": "Зима",
    "3": "Весно",
    "4": "Весна",
    "5": "Весна",
    "6": "Лето",
    "7": "Лето",
    "8": "Лето",
    "9": "Осень",
    "10": "Осень",
    "11": "Осень",
    "12": "Зима"
 }

while True:
    mounth = int(input("Введите Число: "))
    if 12 >= mounth > 0:
        mounth = str(mounth)
        break
    else:
        print("Это на какой планете? Пробуй еще!")

print(calendar.get(mounth))

"""

"""
# С защитой от ошибки, через Список

calendar_list = [[1, "Зима"], [2, "Зима"], [3, "Весна"], [4, "Весна"], [5, "Весна"], [6, "Лето"], [7, "Лето"], [8, "Лето"], [9, "Осень"], [10, "Осень"], [11, "Осень"], [12, "Осень"]]

while True:
    mounth = int(input("Введите Число: "))
    if 12 >= mounth > 0:
        a, b = calendar_list[mounth - 1]
        break
    else:
        print("Это на какой планете? Пробуй еще!")

print(b)
"""
